package com.atguigu.scala1128.day02.fun

/**
 * Author atguigu
 * Date 2020/4/21 13:53
 */
object Fun1 {
    def main(args: Array[String]): Unit = {
        
    }
}
/*
面向过程编程:
    c basic...
面向对象编程:
    c++
    java
    c#
    js
    python
        ...
        适合大工程
        
    理解对象?
        代码, 程序   作用:  1. 存数据  2. 对数据做各种运算, 得到想要结果
        面向过程: 存储数据: 定义变量,  定义函数: 做运算
        
        面向对象:
            用对象进行封装
            对象其实是对数据和行为的封装!!!
            
            类:  更加方便的去封装对象
            
函数式编程:
    haskell 函数递归完成循环
    scala
        完美融合  面向对象和函数式
        
    一切皆函数!
        函数就是一等公民, 可以做为参数传递, 也可以作为返回值返回.
        
    科学领域, 用函数式比较, 在工程领域用面向对象比较方便.
    
    编程的时候, 可以使用函数式编程风格, 也可以使用面向对象的编程风格.
    
    两种结合使用, 整个工程整体采用面向对象, 具体到某些代码更加函数式

 */